zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT500/MIMXRT555S/iar/startup_MIMXRT555S.s
; -------------------------------------------------------------------------
;  @file:    startup_MIMXRT555S.s
;  @purpose: CMSIS Cortex-M33 Core Device Startup File
;            MIMXRT555S
;  @version: 6.0
;  @date:    2024-10-29
;  @build:   b250520
; -------------------------------------------------------------------------
;
; Copyright 1997-2016 Freescale Semiconductor, Inc.
; Copyright 2016-2025 NXP
; SPDX-License-Identifier: BSD-3-Clause
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; The vector table is normally located at address 0.
; When debugging in RAM, it can be located in RAM, aligned to at least 2^6.
; The name "__vector_table" has special meaning for C-SPY:
; it is where the SP start value is found, and the NVIC vector
; table register (VTOR) is initialized to this address if != 0.
;
; Cortex-M version
;

        MODULE  ?cstartup

        ;; Forward declaration of sections.
        SECTION CSTACK:DATA:NOROOT(3)
        SECTION RO:CODE:NOROOT(2)

        SECTION .intvec:CODE:NOROOT(2)

        EXTERN  __iar_program_start
        EXTERN  SystemInit
        PUBLIC  __vector_table
        PUBLIC  __vector_table_0x1c
        PUBLIC  __Vectors
        PUBLIC  __Vectors_End
        PUBLIC  __Vectors_Size

        DATA

;;The vector table is not needed for initialization.
__iar_init$$done

__vector_table
        DCD     sfe(CSTACK)
        DCD     Reset_Handler

        DCD     NMI_Handler                                   ;NMI Handler
        DCD     HardFault_Handler                             ;Hard Fault Handler
        DCD     MemManage_Handler                             ;MPU Fault Handler
        DCD     BusFault_Handler                              ;Bus Fault Handler
        DCD     UsageFault_Handler                            ;Usage Fault Handler
__vector_table_0x1c
        DCD     SecureFault_Handler                           ;Secure Fault Handler
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
        DCD     0x280000 ;Image length
#else
        DCD     sfe(RO) - __vector_table ;Image length
#endif
        DCD     0                                             ;Reserved
        DCD     0                                             ;Reserved
        DCD     SVC_Handler                                   ;SVCall Handler
        DCD     DebugMon_Handler                              ;Debug Monitor Handler
        DCD     __vector_table                                ;Image load address
        DCD     PendSV_Handler                                ;PendSV Handler
        DCD     SysTick_Handler                               ;SysTick Handler

                                                              ;External Interrupts
        DCD     WDT0_IRQHandler                               ;Watchdog timer interrupt
        DCD     DMA0_IRQHandler                               ;DMA interrupt
        DCD     GPIO_INTA_IRQHandler                          ;GPIO Interrupt A
        DCD     GPIO_INTB_IRQHandler                          ;GPIO Interrupt B
        DCD     PIN_INT0_IRQHandler                           ;General Purpose Input/Output interrupt 0
        DCD     PIN_INT1_IRQHandler                           ;General Purpose Input/Output interrupt 1
        DCD     PIN_INT2_IRQHandler                           ;General Purpose Input/Output interrupt 2
        DCD     PIN_INT3_IRQHandler                           ;General Purpose Input/Output interrupt 3
        DCD     UTICK0_IRQHandler                             ;Micro-tick Timer
        DCD     MRT0_IRQHandler                               ;Multi-Rate Timer
        DCD     CTIMER0_IRQHandler                            ;Standard counter/timer CTIMER0
        DCD     CTIMER1_IRQHandler                            ;Standard counter/timer CTIMER1
        DCD     SCT0_IRQHandler                               ;SCTimer/PWM
        DCD     CTIMER3_IRQHandler                            ;Standard counter/timer CTIMER3
        DCD     FLEXCOMM0_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM1_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM2_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM3_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM4_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM5_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM14_IRQHandler                         ;FlexComm interrupt. Standalone SPI
        DCD     FLEXCOMM15_IRQHandler                         ;FlexComm interrupt. Standalone I2C
        DCD     ADC0_IRQHandler                               ;Analog-to-Digital Converter interrupt
        DCD     Reserved39_IRQHandler                         ;Reserved interrupt
        DCD     ACMP_IRQHandler                               ;Analog comparator Interrupts
        DCD     DMIC0_IRQHandler                              ;Digital Microphone Interface interrupt
        DCD     Reserved42_IRQHandler                         ;Reserved interrupt
        DCD     HYPERVISOR_IRQHandler                         ;Hypervisor interrupt
        DCD     SECURE_VIOLATION_IRQHandler                   ;Secure violation interrupt
        DCD     HWVAD0_IRQHandler                             ;Hardware Voice Activity Detector interrupt
        DCD     Reserved46_IRQHandler                         ;Reserved interrupt
        DCD     RNG_IRQHandler                                ;Random Number Generator interrupt
        DCD     RTC_IRQHandler                                ;Real Time Clock Alarm interrupt OR Wakeup timer interrupt
        DCD     Reserved49_IRQHandler                         ;xxx Interrupt 49
        DCD     MU_A_IRQHandler                               ;Messaging Unit - Side A
        DCD     PIN_INT4_IRQHandler                           ;General Purpose Input/Output interrupt 4
        DCD     PIN_INT5_IRQHandler                           ;General Purpose Input/Output interrupt 5
        DCD     PIN_INT6_IRQHandler                           ;General Purpose Input/Output interrupt 6
        DCD     PIN_INT7_IRQHandler                           ;General Purpose Input/Output interrupt 7
        DCD     CTIMER2_IRQHandler                            ;Standard counter/timer CTIMER2
        DCD     CTIMER4_IRQHandler                            ;Standard counter/timer CTIMER4
        DCD     OS_EVENT_IRQHandler                           ;Event timer M33 Wakeup/interrupt
        DCD     FLEXSPI0_FLEXSPI1_IRQHandler                  ;FlexSPI0_IRQ OR FlexSPI1_IRQ
        DCD     FLEXCOMM6_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM7_IRQHandler                          ;FlexComm interrupt
        DCD     USDHC0_IRQHandler                             ;USDHC interrupt
        DCD     USDHC1_IRQHandler                             ;USDHC interrupt
        DCD     SGPIO_INTA_IRQHandler                         ;Secure GPIO HS interrupt 0
        DCD     SGPIO_INTB_IRQHandler                         ;Secure GPIO HS interrupt 1
        DCD     I3C0_IRQHandler                               ;Improved Inter Integrated Circuit 0 interrupt
        DCD     USB0_IRQHandler                               ;USB device
        DCD     USB0_NEEDCLK_IRQHandler                       ;USB Activity Wake-up Interrupt
        DCD     WDT1_IRQHandler                               ;Watchdog timer 1 interrupt
        DCD     USB_PHYDCD_IRQHandler                         ;USBPHY DCD interrupt
        DCD     DMA1_IRQHandler                               ;DMA interrupt
        DCD     PUF_IRQHandler                                ;QuidKey interrupt
        DCD     POWERQUAD_IRQHandler                          ;Powerquad interrupt
        DCD     CASPER_IRQHandler                             ;Caspar interrupt
        DCD     PMU_PMIC_IRQHandler                           ;Power Management Control interrupt
        DCD     HASHCRYPT_IRQHandler                          ;SHA interrupt
        DCD     FLEXCOMM8_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM9_IRQHandler                          ;FlexComm interrupt
        DCD     FLEXCOMM10_IRQHandler                         ;FlexComm interrupt
        DCD     FLEXCOMM11_IRQHandler                         ;FlexComm interrupt
        DCD     FLEXCOMM12_IRQHandler                         ;FlexComm interrupt
        DCD     FLEXCOMM13_IRQHandler                         ;FlexComm interrupt
        DCD     FLEXCOMM16_IRQHandler                         ;FlexComm interrupt
        DCD     I3C1_IRQHandler                               ;Improved Inter Integrated Circuit 1 interrupt
        DCD     FLEXIO_IRQHandler                             ;Flexible I/O interrupt
        DCD     LCDIF_IRQHandler                              ;Liquid Crystal Display interface interrupt
        DCD     GPU_IRQHandler                                ;Graphics Processor Unit interrupt
        DCD     MIPI_IRQHandler                               ;MIPI interrupt
        DCD     Reserved88_IRQHandler                         ;
        DCD     SDMA_IRQHandler                               ;Smart DMA Engine Controller interrupt
__Vectors_End

; Code Read Protection Level (CRP)
;    <0xFFFFFFFF=> Disabled
;    <0x4E697370=> NO_ISP
;    <0x12345678=> CRP1
;    <0x87654321=> CRP2
;    <0x43218765=> CRP3

#if !defined NO_CRP
        SECTION .crp:CODE
__CRP
        DCD     0xFFFFFFFF
__CRP_End
#endif

__Vectors       EQU   __vector_table
__Vectors_Size  EQU   __Vectors_End - __Vectors


;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; Default interrupt handlers.
;;
        THUMB

        PUBWEAK Reset_Handler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
        CPSID   I               ; Mask interrupts
        LDR     R0, =0xE000ED08
        LDR     R1, =__vector_table
        STR     R1, [R0]
        LDR     R2, [R1]
        MSR     MSP, R2
        LDR     R0, =sfb(CSTACK)
        MSR     MSPLIM, R0
        CPSIE   I               ; Unmask interrupts
        LDR     R0, =SystemInit
        BLX     R0
        LDR     R0, =__iar_program_start
        BX      R0

        PUBWEAK NMI_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
        B .

        PUBWEAK HardFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
        B .

        PUBWEAK MemManage_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
        B .

        PUBWEAK BusFault_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
        B .

